---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TrussElementClassParam
source: html/0c4c7128-eb93-e549-bdc9-ecc1b03af90f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TrussElementClassParam Property

"Engineering Type"

## Syntax (C#)
```csharp
public static ForgeTypeId TrussElementClassParam { get; }
```